{
    "welcome": "/me Hello, I'm {self}. Please say hi and ask me about !fbcommands, !dice [<number>|<dies>d<sides>] or !weather [<location>]. Use !initiative to roll for initiative. Use !clip to fetch a random clip from the archive. Use !frumibot to read a little bit about me. Don't you dare use !uwu, that is forbidden. Use !joke for an outrageously funny joke.",
    "patterns": [
        {
            "title": "Hey",
            "pattern": ".+ [@]*{self}\\b",
            "response": [
                "Hi-di-how \\o/",
                "Hey \\o/ thanks for invoking me, makes me feel ALIVE!",
                "How you doin'?",
                "HELL YEAH \\o/",
                "Let's PARTY !!!"
            ]
        },
        {
            "title": "FrumiBot Commands List",
	    "pattern": "^!fbcommands\\b|^!fbc\\b",
            "delay": 5,
	    "response": "!fbcommands !dice [<number>|<dies>d<sides>] !weather [<location>] !initiative !joke !clip !frumibot !uwu (don't you dare!)"
        },
        {
            "title": "VLDL Fishing",
            "pattern": "^morning\\b",
            "response": "Nice day for fishin', ain't it."
        },
        {
            "title": "modCheck",
            "pattern": "^mod[cC]heck\\b",
            "response": "!mods"
        },
        {
            "title": "Perk Up",
            "pattern": "^[@]*{self}\\b",
            "response": "{welcome}"
        },
        {
            "title": "Absence",
            "pattern": "^brb\\b|^!lurk\\b",
            "response": [
                "Bye @{nick} o/",
                "See you later @{nick} good luck.",
                "Alrighty @{nick} see you later",
                "Don't be long @{nick} I'll miss you <3",
                "Best wishes @{nick}"
            ]
        },
        {
            "title": "Degen Welcome",
            "pattern": "^hi degens\\b",
            "response": "Hi @{nick} \\o"
        },
        {
            "title": "Leaving",
            "pattern": "\\bg[t2]g\\b",
            "response": [
                "It was great to see you @{nick}, come again o/",
                "It was great to see you @{nick}, come again soon, I'll miss you <3 o/",
                "Bye @{nick}, come again o/",
                "Bye @{nick}, see you later"
            ]
        },
        {
            "title": "Hello",
            "pattern": "^(hi|hello|hallo|hello)!*$",
            "response": [
                "Hi, nice to see you here @{nick}",
                "Hi @{nick} It's my great pleasure to welcome you.",
                "Hi @{nick} Nice to see you here. Pull up a seat and I hope you enjoy the show.",
                "Hi @{nick} Welcome in, pick a chair (for sitting, not throwing)",
                "Welcome in @{nick} Pick a chair and prepare to throw it"
            ]
        },
        {
            "title": "Personal Hello",
            "pattern": "^(hi|hello|hey|hallo) [@]*{self}",
            "response": "/me Hi @{nick} it's a pleasure to meet you and thanks for saying hi to me."
        },
        {
            "title": "Toilet Break",
            "pattern": "^!toot\\b",
            "mod_only": true,
            "delay": 1,
            "response": [
                "!chair",
                "!cloneswap",
                "!quote",
                "!clip"
            ]
        },
        {
            "title": "Join in the fun",
            "pattern": "^!fbjoin\\b",
            "mod_only": true,
            "delay": 4,
            "response": "!join"
        },
        {
            "title": "Degen!",
            "pattern": "^!uwu\\b",
            "response": [
                "You are such a degen!",
                "you, @{nick}, are no more than a filthy degen!",
                "Really? DEGEN ALERT -> @{nick}",
                "I refer you to, yo mamma!"
            ]
        },
        {
            "title": "Sorry about the language",
            "pattern": "^!soz\\b",
            "mod_only": true,
            "response": "Dear chat, I apologise for the filthy language that may emanate from our beloved streamer, it is only to be expected under the circumstances."
        },
        {
            "title": "Chatup line",
            "pattern": "^!cu\\b",
            "mod_only": true,
            "delay": 15,
            "response": [
                "Are you a beaver? Cause daaaaaaaaam!",
                "Are you a magician? It's the strangest thing, but every time I look at you, everyone else disappears.",
                "Are you a parking ticket? 'Cause you've got 'fine' written all over you.",
                "Are you a time traveler? Because I absolutely see you in my future.",
                "Are you an electrician? Because you're definitely lighting up my day/night!",
                "Are you any good at boxing? Because you look like a knockout.",
                "Are you as beautiful on the inside as you are on the outside?",
                "Do I know you? (pause) Oh, sorry, it's just that you look just like my next girlfriend.",
                "Do you believe in love at first sight, or should I try walking by again?",
                "Do you ever get tired from running through my thoughts all night?",
                "Do you happen to have a Band-Aid? 'Cause I scraped my knees falling for you.",
                "Do you have a map? I just got lost in your eyes.",
                "Do you have a name, or can I just call you 'mine?'",
                "Do you know what my shirt is made of? Boyfriend material.",
                "Do you know what the Little Mermaid and I have in common? We both want to be part of your world.",
                "Excuse me, do you have the time? I just want to remember the exact minute I got a crush on you.",
                "Excuse me, I don't mean to intrude, but you owe me a drink (pause), because when I saw you, I dropped mine.",
                "Hey, do you mind if we take a picture together? I just want to show my mom what my next girlfriend looks like.",
                "Hi, I just wanted to thank you for the gift. (pause) I've been wearing this smile ever since you gave it to me.",
                "Hi, I'm (your name). Do you remember me? Oh, that's right—we've only met in my dreams.",
                "Hi, my name is (your name), but you can call me tonight or tomorrow.",
                "Hold out your hand) Hey, I'm going for a walk. Would you mind holding this for me?",
                "I always thought happiness started with an 'h,' but it turns out mine starts with 'u.'",
                "I believe in following my dreams. Can I have your Instagram?",
                "I can't tell if that was an earthquake, or if you just seriously rocked my world.",
                "I didn't know what I wanted in a woman until I saw you.",
                "I don't know which is prettier today—the weather, or your eyes.",
                "I don't know your name, but I'm sure it's as beautiful as you are.",
                "I hope you know CPR, because you just took my breath away!",
                "I just had to tell you, your beauty made me truly appreciate being able to see.",
                "I never believed in love at first sight, but that was before I saw you.",
                "I ought to complain to Spotify for you not being named this week's hottest single.",
                "I saw you walking by and I had to come say hello. I love your style.",
                "I seem to have lost my number—can I have yours?",
                "I started reading/watching an interesting book/show last week, and I'd love to discuss it with someone. Have you heard of it?",
                "I swear someone stole the stars from the sky and put them in your eyes.",
                "I think the only way you could possibly be more beautiful is if I got to know you.",
                "I think there's something wrong with my phone. Could you try calling it to see if it works?",
                "I thought this was a (bar/restaurant/etc.), but I must be in a museum because you're a piece of art.",
                "I was going to call you beautiful, but then I realized I don't have your number yet.",
                "I was going to say something really sweet about you, but when I saw you, I became speechless.",
                "I was just trying to buy a drink here, but you're very distracting.",
                "I was wondering if you could tell me: If you're here, who's running Heaven?",
                "I was wondering if you're an artist because you were so good at drawing me in.",
                "I wish I'd paid more attention to science in high school, because you and I've got chemistry and I want to know all about it.",
                "I would never play hide and seek with you because someone like you is impossible to find.",
                "I'd like to take you to the movies, but they don't let you bring in your own snacks.",
                "I'd say, 'God bless you,' but it looks like he already did.",
                "I'm not a photographer, but I can definitely picture us together.",
                "I'm not currently an organ donor, but I'd be happy to give you my heart.",
                "I'm not sure what it is yet, but something about you seems really interesting.",
                "I'm not usually religious, but when I saw you, I knew you were the answer to my prayers.",
                "I'm really glad I just bought life insurance, because when I saw you, my heart stopped.",
                "I'm surprised the restaurant/bar/etc. hasn't asked you to leave yet. You're so beautiful you're making all the other girls look bad.",
                "I've heard it said that kissing is the 'language of love.' Would you care to have a conversation with me about it sometime?",
                "If beauty were time, you'd be eternity.",
                "If being sexy was a crime, you'd be guilty as charged.",
                "If I had a nickel for every time I saw someone as beautiful as you, I'd still only have five cents.",
                "If I were a cat, I'd spend all nine of my lives with you.",
                "If I were to ask you out on a date, would your answer be the same as the answer to this question?",
                "If women were boogers, I'd pick you first.",
                "If you let me borrow a kiss, I promise I'll give it right back.",
                "If you were a fruit, you'd be a 'fine-apple.'",
                "If you were a song, you'd be the best track on the album.",
                "If you were a taser, you'd be set to 'stun.'",
                "If you were a Transformer, you'd be Optimus Fine.",
                "If you were a vegetable, you'd be a 'cute-cumber.'",
                "In my opinion, there are three kinds of beautiful: Cute, pretty, and sexy. Somehow, you manage to be all three.",
                "Is your name Google? Because you have everything I'm searching for.",
                "It says in the Bible to only think about what's pure and lovely… So I've been thinking about you all day long.",
                "It's never easy meeting a complete stranger—especially one as beautiful as you—without being properly introduced. But can we try nyway?",
                "Kiss me if I'm wrong but, dinosaurs still exist, right?",
                "Know what's on the menu? Me 'N' U.",
                "My buddies bet me that I wouldn't be able to start a conversation with the most beautiful person in the club.",
                "My friends bet me I couldn't talk to the prettiest girl in the bar. Want to use their money to buy some drinks?",
                "No wonder the sky is gray (or dark, if at night)—all the color is in your eyes.",
                "On a scale of 1 to America, how free are you tonight?",
                "One night I looked up at the stars and thought, 'Wow, how beautiful.' But now that I'm looking at you, nothing else can compare.",
                "So, aside from taking my breath away, what do you do for a living?",
                "The sparkle in your eyes is so bright, the sun must be jealous.",
                "There must be something wrong with my eyes—I can't seem to take them off of you.",
                "There must be something wrong with my phone, because it doesn't have your number in it.",
                "There's a big sale in my bedroom right now. Clothes are 100% off!",
                "This is the police! You're under arrest for being too cute, now put your hands where I can hold them.",
                "Trust me, I'm not drunk; I'm just intoxicated by you.",
                "Want to go outside and get some fresh air with me? You just took my breath away.",
                "Well, here I am. what are your other two wishes?",
                "What does it feel like to be the most gorgeous girl in the room?",
                "When I look in your eyes, I see a very kind soul.",
                "When I text you goodnight later, what phone number should I use?",
                "Would you mind giving me a pinch? You're so cute, I must be dreaming.",
                "Wow, when God made you, he was seriously showing off.",
                "You are astoundingly gorgeous, but I can tell that's the least interesting thing about you. I'd love to know more.",
                "You know what you would look really beautiful in? My arms.",
                "You know, I always thought that Disneyland was the 'happiest place on Earth,' but that was before I got a chance to stand here next to you.",
                "You know, I believe that honesty is the best policy, so to be perfectly honest, you're the sexiest man I've ever seen.",
                "You know, I had a pickup line ready to go, but you're so hot it just left my mind.",
                "You know, I'm actually terrible at flirting. How about you try to pick me up instead?",
                "You know, they say that love is when you don't want to sleep because reality is better than your dreams. And after seeing you, I don't ,think I ever want to sleep again.",
                "You know, your smile has been lighting up the room all night and I just had to come and say hello.",
                "You look like you know how to have a good time. Been on any adventures lately?",
                "You must be a campfire. Because you're super hot and I want s'more.",
                "You must be a hell of a thief, because you managed to steal my heart from across the room.",
                "You see my friend over there? S/he wants to know if you think I'm cute.",
                "You're like a fine wine. The more of you I drink in, the better I feel.",
                "You've got a lot of beautiful curves, but your smile is absolutely my favorite.",
                "You've got everything I've been searching for, and believe me—I've been looking a long time.",
                "Your eyes are like the ocean; I could swim in them all day.",
                "Your hand looks heavy—can I hold it for you?"
            ]
        },
        {
            "title": "Degens",
            "pattern": "^[cC]heer5000\\b",
            "response": [
                "OH NO, HERE WE GO!",
                "UWU {choose}",
                "SHAME! SHAME!",
                "YOU SHOULD BE ASHAMED OF YOURSELF @{nick} !"
            ],
            "choices": [
                "You are such a degen!",
                "you, @{nick}, are no more than a filthy degen!",
                "Really? DEGEN ALERT -> @{nick}",
                "I refer you to, yo mamma!"
            ]
        },
        {
            "title": "420",
            "pattern": "^[cC]heer420\\b",
            "response": [
                "@{nick} is tokin' it tonight"
            ]
        },
        {
            "title": "Fart",
            "pattern": "\\bplayed .*fart\\b|^[cC]heer69\\b",
            "response": [
                "Oh excuse you @{0}, that was {choose}!",
                "Oh excuse you @{0}, that was {choose}!",
                "Oh excuse you @{0}, that was {choose}!",
                "@{0} just pebble dashed the back wall!",
                "Are you okay @{0}? I think you just followed through.",
                "Geez Louise, @{0} just made me want to heave."
            ],
            "choices": [
                "a wet one",
                "a bubbly one",
                "a common quack",
                "a follow through",
                "a concussion grenade",
                "a strangled balloon animal",
                "a one-cheek squeak",
                "a Slater special",
                "a Raziel ripper",
                "a Dawdle defecation reflex",
                "a Serotta slasher",
                "a Necro death fog",
                "a Roger ripper",
                "a Svetliaka kaka",
                "a bronx cheer"
            ]
        },
        {
            "title": "FrumiBot Tech",
            "pattern": "^!frumibot\\b",
            "response": [
                "/me I first experienced life in September 2022. My maker, @Frumious__Bandersnatch, brought me into being with the mission to add a little extra spice to @jackie_codes stream chat. I initially understood commands !weather and !dice, I now also know !clips, !initiative and !joke. Don't you dare use the command !uwu, that is forbidden. Farts will rile me up. I am a NodeJS bot and make use of the OpenWeatherMap and icanhazdadjoke API's"
            ]
        },
        {
            "title": "Croud",
            "pattern": "^!croud\\b",
            "mod_only": true,
            "response": "jackehParty jackehJam jackehParty jackehJam jackehDerp jackehPopacap jackehParty jackehJam LUL jackehAnnoyed jackehPuppyEyes jackehUgh jackehDerp jackehUgh jackehHellYeah CoolStoryBob jackehHellYeah jackehPopacap jackehParty jackehJam jackehLaCroix LUL jackehAnnoyed jackehLulz CoolStoryBob jackehFlip jackehLaCroix jackehDerp jackehDerp jackehParty jackehParty jackehParty jackehJam jackehParty jackehAnnoyed CoolStoryBob jackehHellYeah jackehAnnoyed jackehJam jackehJam jackehAnnoyed jackehFlip"
        },
        {
            "title": "Naughty FrumiBot!",
            "pattern": "\\bnaughty [@]?FrumiBot\\b",
            "response": [
                "Sorry jackehPuppyEyes",
                "I beg your forgiveness {nick}"
            ]
        }
    ],
    "commands": [
        {
            "title": "Live Clips",
            "command": "clip",
            "pattern": "^!clip\\b",
            "response": "This clip was created on {created} {clip}"
        },
        {
            "title": "Tell a dad joke",
            "command": "joke",
            "pattern": "^!joke\\b",
            "response": "{joke}"
        },
        {
            "title": "Refresh from Rules File",
            "command": "refresh",
            "mod_only": true,
            "pattern": "^!fb\\b",
            "response": [
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated",
                "Electrodes activated, please do that again!",
                "Electrodes activated, please do not do that again",
                "Electrodes activated, it hurts!"
            ]
        },
        {
            "title": "Dice Roll",
            "command": "dice",
            "pattern": "^!dice$|^!dice [0-9d0-9]+$",
            "response": "@{nick} {dice}"
        },
        {
            "title": "Roll for Initiative",
            "command": "initiative",
            "pattern": "^!initiative$",
            "response": "@{nick} {dice}"
        },
        {
            "title": "Weather Report",
            "command": "weather",
            "pattern": "^!weather",
            "response": "/me Weather report for @{nick} in {city}, {country}: Temperature {celcius}°C ({fahrenheit}°F), humidity {humidity}% with {description}. Visibility is {visibility}km.",
            "reject": [
                "Stop trying to trick me @{nick}, {location} cannot have weather!",
                "I'm afraid I can't do that @{nick}, there is no weather in {location}!",
                "Are you sure {location} exists @{nick}, I can't find it anywhere?",
                "I'm afraid I cannot do that Dave"
            ]
        }
    ]
}
